[{"SpeakerURI":"/api/speakers.json/Christopher-H-Laco","Name":"Christopher H. Laco","Biography":"Chris is currently a Engineer at Within3 in Cleveland, OH. He's been a programmer, webmaster, and all around jack of all trades in the industry for over 16 years in various languages including Perl, Ruby, C#, VB.NET, and remembers what a modem and Mosaic 1.0 looks like. :-)","TwitterHandle":"@claco","BlogURL":"http://chrislaco.com","Sessions":["/api/sessions.json/Testing-Its-Not-Just-for-Your-Code"],"LookupId":"Christopher-H-Laco"},{"SpeakerURI":"/api/speakers.json/Jonathan-Penn","Name":"Jonathan Penn","Biography":"Jonathan Penn is a software developer, author, and entrepreneur with a long history of quality work enriched with mischief. He speaks on software development topics whenever he gets a chance, is the mad scientist behind the apps at navel-labs.com, and scribbler-in-chief at cocoamanifest.net, a technical blog for exceptional iOS resources and commentary.\n","TwitterHandle":"@jonathanpenn","BlogURL":"http://cocoamanifest.net","Sessions":["/api/sessions.json/RubyMotion-for-iOS"],"LookupId":"Jonathan-Penn"},{"SpeakerURI":"/api/speakers.json/Seth-Juarez","Name":"Seth Juarez","Biography":"Seth Juarez has a Master’s Degree in Computer Science where his field of research was Artificial Intelligence specifically in the realm of Machine Learning. He is a Technical Evangelist for DevExpress where he specializes in data analysis and shaping in conjunction with their reporting toolset. When he is not working in that area, he devotes his time to an open source Machine Learning Library specifically for .NET that is intended to simplify the use of popular supervised and unsupervised learning models.","TwitterHandle":"@sethjuarez","BlogURL":"http://www.devexpress.com/seth","Sessions":["/api/sessions.json/Machine-Learning--Predicting-the-Future","/api/sessions.json/Machine-Learning--Understanding-the-Past"],"LookupId":"Seth-Juarez"},{"SpeakerURI":"/api/speakers.json/Michael-Pardo","Name":"Michael Pardo","Biography":"Michael Pardo is a software engineer working in Ann Arbor, Michigan, writing Android apps at Mobiata, an Expedia company. He's been working as a developer for over eight years. Most of that time was spent writing web apps using C#. Now he spends most of his time writing featured Android apps.\n\nHe also writes an active record style ORM for Android called ActiveAndroid. ActiveAndroid allows you to easily persist objects to SQLite databases in Android. He's also the author of RingDimmer – a featured Android app that sets your ring volume to the room volume.","TwitterHandle":"@pardom","BlogURL":"http://www.michaelpardo.com","Sessions":["/api/sessions.json/Android-Custom-Views-the-Right-Way"],"LookupId":"Michael-Pardo"},{"SpeakerURI":"/api/speakers.json/Jesse-Liberty","Name":"Jesse Liberty","Biography":"Jesse Liberty is a Technical Evangelist for Telerik.  Liberty  hosts the popular Yet Another Podcast and his blog is required reading. He is the author of numerous best-selling books, including two forthcoming books on Windows 8. He was a Senior Evangelist for Microsoft,  Distinguished Software Engineer at AT&T; Software Architect for PBS and Vice President of Information Technology at Citibank. Jesse can be followed on twitter at @JesseLiberty","TwitterHandle":"@jesseliberty","BlogURL":"http://jesseliberty.com","Sessions":["/api/sessions.json/Crash-Course-in-Windows-8-","/api/sessions.json/Crash-Course-in-Windows-8--Beyond-the-Basics"],"LookupId":"Jesse-Liberty"},{"SpeakerURI":"/api/speakers.json/Dan-Shultz","Name":"Dan Shultz","Biography":"Dan has been building web applications since 2005 across multiple languages including Java, C#, Ruby and Javascript and is also spending some time in Objective C. He grew up in the Cleveland area and enjoys spending his time in and around the downtown Cleveland. Dan is currently working in Ruby and Javascript and spends time contributing to local meetup groups in the area by speaking and facilitating open space discussions. When not coding, he is spending time with his family or brewing beer.","TwitterHandle":"@danshultz","BlogURL":"http://weavingcode.blogspot.com","Sessions":["/api/sessions.json/Mastering-ActiveRecord-Scopes-and-Active-Relationship"],"LookupId":"Dan-Shultz"},{"SpeakerURI":"/api/speakers.json/Jason-Follas","Name":"Jason Follas","TwitterHandle":"@jfollas","BlogURL":"http://jasonfollas.com","Sessions":["/api/sessions.json/Quantum-Entanglement-for-your-Web-Apps-using-SignalR-and-Knockout-"],"LookupId":"Jason-Follas"},{"SpeakerURI":"/api/speakers.json/David-Giard","Name":"David Giard","Biography":"David Giard has been developing solutions using Microsoft technologies since 1993.  He is a Microsoft MVP; a member of the INETA Board of Directors; and a past President of the Great Lakes Area .Net User Group. David has presented at dozens of conferences and user groups over the years.  He is a recovering certification addict and holds an MCTS, MCSD, MCSE, and MCDBA, as well as a BS and an MBA.  He is the host and producer of the mildly popular online TV show Technology and Friends. He is the co-author of the Wrox book Real World .NET, C#, and Silverlight. You can read his latest thoughts at www.DavidGiard.com.  David lives in Michigan with his two sons.  ","TwitterHandle":"@DavidGiard","BlogURL":"http://DavidGiard.com","Sessions":["/api/sessions.json/How-I-Learned-to-Stop-Worrying-and-Love-jQuery"],"LookupId":"David-Giard"},{"SpeakerURI":"/api/speakers.json/Keith-Burnell","Name":"Keith Burnell","Biography":"Keith Burnell is a Web Microsoft MVP and Senior Software Engineer with Skyline Technologies.  He has been developing software for over 15 years specializing in large scale ASP.NET and ASP.NET MVC web site development and architecture as well as teaching and mentoring clients on the benefits of test-driven development. \n\nKeith is an active member of the .NET community who speaks regularly at local and regional user groups and developer events as well as at national conferences. He is an avid blogger and writer and has been featured multiple times in MSDN magazine. \n\nKeith has two wonderful daughters and is married to his high school sweetheart who is still way out of his league! \n\nWhen not slinging code, Keith enjoys spending time with his family, karate, golf, and woodworking.\n","TwitterHandle":"@keburnell","BlogURL":"http://www.dotnetdevdude.com","Sessions":["/api/sessions.json/Reach-the-Mobile-Masses-with-ASPNET-MVC-4-and-jQuery-Mobile"],"LookupId":"Keith-Burnell"},{"SpeakerURI":"/api/speakers.json/Jeff-Blankenburg","Name":"Jeff Blankenburg","Biography":"Ultra passionate. That’s how Jeff Blankenburg describes his relationship with technology. Over the past 10 years, Jeff has enthusiastically applied his technical expertise to build industry-changing websites and marketing efforts for mega brands including Victoria’s Secret, Abercrombie & Fitch, Ford Motor Company, Sony, and several pharmaceutical companies. He’s especially proficient in user interface design, web standards and mobile application development. In addition to his developer evangelist role for Microsoft, Jeff co-authored Migrating to Windows Phone, and is currently writing Programming Windows Phone 8 for O'Reilly. He also serves as an organizer for the CodeMash and Stir Trek conferences. On the academic front, Jeff holds a Bachelor of Science degree in Psychology from Ohio’s Bowling Green State University.","TwitterHandle":"@jeffblankenburg","BlogURL":"http://jeffblankenburg.com","Sessions":["/api/sessions.json/Design-For-Developers-Why-Windows-8-Will-Make-You-Creative","/api/sessions.json/KidzMash-Why-I-Write-Software"],"LookupId":"Jeff-Blankenburg"},{"SpeakerURI":"/api/speakers.json/Kevin-Griffin","Name":"Kevin Griffin","Biography":"Kevin Griffin has been working as a professional developer since 2006, where his first job was working on components for the Symantec security suites.  Kevin is the owner of Griffin Consulting, Inc, CTO of Winsitter, and always looking for new challenges.  As an Microsoft ASP.NET MVP and ASPInsider, Kevin spends a lot of time teaching and mentoring developers to learn new technologies and to be better developers.  Over three years ago, Kevin started the Hampton Roads .NET Users Group.  He serves as the Director of Membership for INETA.  You can find Kevin speaking at conferences, code camps, and user groups across the country. ","TwitterHandle":"@1kevgriff","BlogURL":"http://www.kevgriffin.com","Sessions":["/api/sessions.json/Building-Real-Time-Web-Applications"],"LookupId":"Kevin-Griffin"},{"SpeakerURI":"/api/speakers.json/Jared-Faris","Name":"Jared Faris","Biography":"Jared is a software engineer at Facio, a startup building tools to visualize how people work together to improve their happiness and productivity. He spends a lot of his time experimenting with technologies and teaching others about them. He's a strong advocate of cloud computing and is passionate about user experience. He's a cofounder of the CloudDevelop conference and frequent speaker at regional events. You can find out more about him at http://jaredthenerd.com or follow him @jaredthenerd.","TwitterHandle":"@jaredthenerd","BlogURL":"http://jaredthenerd.com","Sessions":["/api/sessions.json/Building-Rich-User-Experiences-Without-JavaScript-Spaghetti"],"LookupId":"Jared-Faris"},{"SpeakerURI":"/api/speakers.json/Chris-Gardner","Name":"Chris Gardner","Biography":"Chris Gardner is the Senior Software Engineer and Architect for T & W Operations, Inc. Tortured by years of contracts that valued buzzwords over results, Chris has developed a true passion for finding solutions that fit the problem, not the status quo. Chris received his B.S. in Mathematics and B.A. in Philosophy from the University of Alabama in Huntsville and is currently a Microsoft Certified Professional Developer, Information Technology Professional and Trainer.","TwitterHandle":"@freestylecoder","BlogURL":"http://blog.freestylecoding.com","Sessions":["/api/sessions.json/Beginning-Xbox-360-Development-with-the-XNA-Framework","/api/sessions.json/Intermediate-Xbox-360-Development-with-the-XNA-Framework"],"LookupId":"Chris-Gardner"},{"SpeakerURI":"/api/speakers.json/Brandon-Satrom","Name":"Brandon Satrom","Biography":"Brandon Satrom (@BrandonSatrom) is Product Manager for Kendo UI and is based in Austin, TX. A unapologetic lover of the open web, Brandon loves to talk about HTML, JavaScript, CSS, open source and whatever new shiny tool or technology has distracted him from that other thing he was working on. Brandon has spoken at several regional and national events (like CodeMash and TechEd, to name a few), and he loves hanging out with and learning from other passionate developers, both online and in person. He also loves writing and, in addition to having several articles featured in publications like MSDN Magazine and .net Magazine, he's hard at work on a book (\"Building Apps for Windows 8 in JavaScript\") with Chris Sells, slated for release December 2012.","TwitterHandle":"@brandonsatrom","BlogURL":"http://www.userinexperience.com","Sessions":["/api/sessions.json/Secrets-of-Awesome-JavaScript-API-Design","/api/sessions.json/HTML5-Workshop-Wednesday-Half-Day-AM"],"LookupId":"Brandon-Satrom"},{"SpeakerURI":"/api/speakers.json/Daniel-Bower","Name":"Daniel Bower","Biography":"Daniel Bower has worked with a variety of technologies, but has focused on the JVM and unix.  His specialties are integration and build systems on the JVM.  Daniel is currently a developer at Infinum, a custom software provider with a focus on creating software products for higher education.","TwitterHandle":"@danieldbower","BlogURL":"https://bowerstudios.com","Sessions":["/api/sessions.json/Version-your-database-on-nearly-any-platform-with-Liquibase"],"LookupId":"Daniel-Bower"},{"SpeakerURI":"/api/speakers.json/Frederic-Simon","Name":"Frederic Simon","Biography":"Frederic Simon is best known as the Co-founder and Chief Architect of JFrog - the Artifactory Binary Repository creators, and JavaOne 2011 Duke Choice Awards  winner.\n\nBefore founding JFrog in 2008, Fred founded AlphaCSP, the Java consulting firm in 1998 where he was the company's global CTO, leading 5 branches worldwide and served as the visionary voice of the company.\n\nFred’s development experience goes back to 1992 and covers Java technologies evolution from day one as a programmer, Architect and Consultant.\n\nAs one of JFrog leaders, Fred encourages strong collaboration with leading open-source  projects such as SpringSource, Grails and Gradle  by providing them with the Artifactory Cloud platform, and fuels the Continuous-Integration ecosystem with open-source plugins for leading tools such as Jenkins, TeamCity & Bamboo. \n\nWhen not on those Fred hacks around  new features for the core Java language, Java port of the popular sky rendering Stellarium project and other neat stuff.\n\nFred's speaking history: http://lanyrd.com/profile/freddy33/sessions/","TwitterHandle":"@freddy33","BlogURL":"http://freddy33.blogspot.com","Sessions":["/api/sessions.json/Managing-Modular-Software-for-your-NuGet-C-and-Java-Development","/api/sessions.json/How-we-Took-Our-Serverside-Application-to-the-Cloud-and-Liked-What-We-Got"],"LookupId":"Frederic-Simon"},{"SpeakerURI":"/api/speakers.json/Matthew-D-Groves","Name":"Matthew D. Groves","Biography":"Matthew D. Groves is a guy who loves to code.  It doesn't matter if it's \"enterprisey\" C# apps, cool jQuery stuff, contributing to OSS, or rolling up his sleeves to dig into some PHP.  He has been coding professionally ever since he wrote a QuickBASIC point-of-sale app for his parent's pizza shop back in the 90s.  He currently works from home on the Telligent product team, and loves spending time with his wife and 2 kids, watching the Cincinnati Reds, and getting involved in the developer community.  He is currently writing a book for Manning about aspect-oriented programming in .NET, and also teaches a class on web development at Capital University in Columbus, Ohio.","TwitterHandle":"@mgroves","BlogURL":"http://mgroves.com","Sessions":["/api/sessions.json/The-Class-that-Knew-too-Much-Refactoring-Spaghetti-Code"],"LookupId":"Matthew-D-Groves"},{"SpeakerURI":"/api/speakers.json/Andrew-Glover","Name":"Andrew Glover","Biography":"I am a developer, author, speaker, and entrepreneur. I founded Vanward Technologies in 2001 where I served as CTO and then CEO. Vanward was acquired by JNetDirect in 2005 and was re-branded as Stelligent in 2006, where I served as President. In 2008, I founded Beacon50 where I served as Managing Partner. I am currently the CTO of App47.\n\nI'm the founder of the 2009 Jolt award winning easyb Behavior-Driven Development framework and am the co-author of a number of books including 2008's Jolt award winning Continuous Integration, Groovy in Action, and Java Testing Patterns. I regularly write about software development and the software industry at www.thediscoblog.com and I'm fortune enough to have the opportunity to speak to a variety of audiences at various conferences around the globe on such topics as Behavior Driven Development, Cloud Computing, and Agile Software Development.","TwitterHandle":"@aglover","BlogURL":"http://thediscoblog.com","Sessions":["/api/sessions.json/HTML-5-and-the-Great-Mobile-Debate"],"LookupId":"Andrew-Glover"},{"SpeakerURI":"/api/speakers.json/Bill-Sempf","Name":"Bill Sempf","Biography":"Husband. Father. Author. Software composer. Brewer. Lockpicker. Ninja.\nInsurrectionist. Honorary blue teamer. Lumberjack. Working on a Win8\nbook.","TwitterHandle":"@sempf","BlogURL":"http://www.sempf.net","Sessions":["/api/sessions.json/Riding-the-Metro-Real-World-Stories-from-the-Trenches"],"LookupId":"Bill-Sempf"},{"SpeakerURI":"/api/speakers.json/David-Hoerster","Name":"David Hoerster","Biography":"David Hoerster, a C# MVP, is a recovering corporate financial analyst and has been working with the Microsoft .NET Framework since the early 1.0 betas. He is the co-founder of BrainCredits (www.braincredits.com), a recent start-up that is hoping to change the way people learn on the web. David is the co-chair of the Pittsburgh .NET User’s Group (PGHDOTNET), organizer of Pittsburgh TechFest 2012, several recent Pittsburgh Code Camps and is also an occasional speaker at Pittsburgh and regional user groups and code camp events. David can be found rarely blogging at http://geekswithblogs.net/DavidHoerster and also is an occasional Tweeter (@DavidHoerster).","TwitterHandle":"@DavidHoerster","BlogURL":"http://www.geekswithblogs.net/DavidHoerster","Sessions":["/api/sessions.json/I-Didnt-Know-JavaScript-Could-Do-That-The-Missing-Introduction-to-the-Worlds-Most-Misunderstood-Language"],"LookupId":"David-Hoerster"},{"SpeakerURI":"/api/speakers.json/Bruce-Eckel","Name":"Bruce Eckel","Biography":"Bruce Eckel (www.MindviewInc.com) is the author of \"Thinking in Java\" and \"Thinking in C++,\" among others. He's given hundreds of presentations throughout the world, published over 150 articles in numerous magazines, was a founding member of the ANSI/ISO C++ committee and speaks regularly at conferences. He provides public and private training and consulting in programming languages and software system design. He's currently coauthoring \"Atomic Scala\" with Dianne Marsh.","TwitterHandle":"@BruceEckel","BlogURL":"http://www.artima.com/weblogs/index.jsp?blogger=beckel","Sessions":["/api/sessions.json/Rethinking-Errors-Learning-from-Scala-and-Go","/api/sessions.json/Scala-as-a-Better-Java"],"LookupId":"Bruce-Eckel"},{"SpeakerURI":"/api/speakers.json/John-Michael-Hauck","Name":"John Michael Hauck","Biography":"John Hauck has been developing software professionally in Michigan since 1981, and focused on Windows-based development since 1988. For the past 17 years John has been working at LECO, a scientific laboratory instrument company, where he manages software development. John also served as the manager of software development at Zenith Data Systems, and as the Vice President of software development at TechSmith. John loves the Lord, his wife, their three kids, and sailing on Lake Michigan.","TwitterHandle":"@john_hauck","BlogURL":"http://w8isms.blogspot.com","Sessions":["/api/sessions.json/Controlling-Precision-Electric-Motors"],"LookupId":"John-Michael-Hauck"},{"SpeakerURI":"/api/speakers.json/Evan-Hauck","Name":"Evan Hauck","Biography":"Evan is a high school junior who has been spending half his high school day at the Math & Science Center at Andrews University. Evan is an accomplished C# and GPU programmer who is at ease with all things parallel.  Evan won an Intel Excellence in Computer Science Award in 2011 for his work in recreating the experiments of Comte de Buffon, and claimed 1st place with his teammates in the National Institute of Aerospace’s NASA Engineering Design Challenge in 2012.","Sessions":["/api/sessions.json/Compute-Faster-with-the-GPU-in-C"],"LookupId":"Evan-Hauck"},{"SpeakerURI":"/api/speakers.json/Steve-Madsen","Name":"Steve Madsen","Biography":"Steve shipped his first commercial software (a Turbo Pascal toolkit for writing BBS and \"door\" software) while still in high school. He hasn't found himself far away from a network stack since then, from writing Linux and Solaris network drivers to web apps in Java and Ruby. An iOS developer since 2008, he was the lead developer for nine apps currently on the App Store and a contributor to several others. Steve is a founding member and Principal Engineer at Light Year Software, LLC.","TwitterHandle":"@sjmadsen","BlogURL":"http://lightyearsoftware.com/category/blog","Sessions":["/api/sessions.json/Essential-Cocoa-Networking"],"LookupId":"Steve-Madsen"},{"SpeakerURI":"/api/speakers.json/James-Kovacs","Name":"James Kovacs","Biography":"James Kovacs is a Technical Evangelist for JetBrains. He is passionate in sharing his knowledge about OO, SOLID, TDD/BDD, testing, object-relational mapping, dependency injection, refactoring, continuous integration, and related techniques.\n\nHe blogs on CodeBetter.com as well as his own blog, is a technical contributor for Pluralsight, writes articles for MSDN Magazine and CoDe Magazine, and is a frequent speaker at conferences and user groups. He is the creator of psake, a PowerShell-based build automation tool, intended to save developers from XML Hell.\n\nJames is the Ruby Track Chair for DevTeach, one of Canada’s largest independent developer conferences. He received his Bachelors degree from the University of Toronto and his Masters degree from Harvard University.","TwitterHandle":"@jameskovacs","BlogURL":"http://jameskovacs.com","Sessions":["/api/sessions.json/Testable-JavaScript","/api/sessions.json/Emergent-Architecture-with-TDDBDD"],"LookupId":"James-Kovacs"},{"SpeakerURI":"/api/speakers.json/Nayan-Hajratwala","Name":"Nayan Hajratwala","Biography":"http://www.linkedin.com/profile/view?id=2759828","TwitterHandle":"@nhajratw","BlogURL":"http://agileshrugged.com","Sessions":["/api/sessions.json/Test-Driving-User-Interfaces","/api/sessions.json/Better-Metrics-for-your-Team"],"LookupId":"Nayan-Hajratwala"},{"SpeakerURI":"/api/speakers.json/Jamie-Allen","Name":"Jamie Allen","Biography":"Jamie Allen has over 18 years of experience delivering enterprise solutions across myriad industries, platforms, environments and languages. He has been developing enterprise applications with Scala since 2009, primarily using Actors for fault tolerance and managing concurrency at scale.","TwitterHandle":"@jamie_allen","BlogURL":"http://blog.typesafe.com","Sessions":["/api/sessions.json/Effective-Actors"],"LookupId":"Jamie-Allen"},{"SpeakerURI":"/api/speakers.json/Justin-Searls","Name":"Justin Searls","Biography":"Justin Searls has two professional passions: writing great software and sharing what he’s learned in order to help others write even greater software. He recently co-founded a new software studio called Test Double, where he’s currently helping clients build well-crafted user experiences for the web.","TwitterHandle":"@searls","BlogURL":"http://searls.testdouble.com","Sessions":["/api/sessions.json/Budgeting-Reality-a-Nuanced-Discussion-on-Mock-Objects","/api/sessions.json/Realworld-JavaScript-Testing-Wednesday-Half-Day-PM"],"LookupId":"Justin-Searls"},{"SpeakerURI":"/api/speakers.json/Javier-Lozano","Name":"Javier Lozano","Biography":"Javier is an ASP.NET Insider and MVP that specializes in ASP.NET, system architecture, and training. He has helped co-found the Iowa .NET Users Group, the Iowa Code Camp.  He’s heavily involved with the Community for MVC (C4MVC) virtual user group and the aspConf virtual conference.  Javier is also the author and primary contributor to the MVC Turbine open source project.\n\nOn his blog, http://lozanotek.com/blog, you can find posts on ASP.NET, web development, and design patterns just to name a few topics. Javier is an avid supporter of the community and likes to give back by speaking at user groups, local/regional/national .NET events, participating in forums, and by writing articles. In his spare time, Javier loves spending time with his family and enjoys writing about himself in the third person.\n","TwitterHandle":"@jglozano","BlogURL":"http://lozanotek.com/blog","Sessions":["/api/sessions.json/Advanced-ASPNET-MVC--CANCELLED"],"LookupId":"Javier-Lozano"},{"SpeakerURI":"/api/speakers.json/Jen-Myers","Name":"Jen Myers","Biography":"Jen Myers is a web/interface designer at the software company Relevance. She works from Columbus, Ohio, where she also teaches HTML/CSS and organizes the coding education program Girl Develop It Columbus. Her particular areas of interest are user experience, teaching innovation and exploring the intersection between design and development. She also likes good movies, comic books and frequently changing her hair color.","TwitterHandle":"@antiheroine","BlogURL":"http://jenmyers.net","Sessions":["/api/sessions.json/StraightUp-Design-Simple-Ways-for-Devs-to-Make-Apps-Look-and-Work-Better"],"LookupId":"Jen-Myers"},{"SpeakerURI":"/api/speakers.json/Chris-Adamson","Name":"Chris Adamson","Biography":"Chris Adamson is a writer and independent developer specializing in media software development. He is the co-author of \"Learning Core Audio: A Hands-On Guide to Audio Programming for Mac and iOS\" (Addison-Wesley Professional) and \"iOS SDK Development\" (Pragmatic Progammers), among others. He maintains a corporate identity as Subsequently & Furthermore, Inc. (http://www.subfurther.com/) and writes the [Time code]; blog at http://www.subfurther.com/blog. He lives and works in Grand Rapids, Michigan, and over the years he's managed to own 13 1/2 Macs.","TwitterHandle":"@invalidname","BlogURL":"http://www.subfurther.com/blog","Sessions":["/api/sessions.json/ObjectiveC-Is-Not-Java","/api/sessions.json/Building-Productive-iOS-6-Apps-Wednesday-Half-Day-PM"],"LookupId":"Chris-Adamson"},{"SpeakerURI":"/api/speakers.json/Mike-Swift","Name":"Mike Swift","Biography":"Meet Swift, developer evangelist at-large for SendGrid and home-grown New York hacker. As a lifelong developer himself, Swift has made it his personal mission to enable developers by helping them get the tools and resources they need to make awesome, creative stuff. Swift is also one of the founders of Hacker League, the platform for hackathons, a former engineer at Crowdtap, and an alumni of Rutgers University.","TwitterHandle":"@SwiftAlphaOne","BlogURL":"http://theycallmeswift.com","Sessions":["/api/sessions.json/Full-Stack-Integration-Tests-with-Nodejs"],"LookupId":"Mike-Swift"},{"SpeakerURI":"/api/speakers.json/Ryan-Rauh","Name":"Ryan Rauh","Biography":"Senior UI/UX developer at Dovetail Software in Austin, TX. C# Developer turned frontend javascript hacker. You are not your server side language. Javascript is the great equallizer","TwitterHandle":"@rauhryan","BlogURL":"http://lostechies.com/ryanrauh","Sessions":["/api/sessions.json/Conjunction-Junction-Whats-Your-function"],"LookupId":"Ryan-Rauh"},{"SpeakerURI":"/api/speakers.json/Jon-Galloway","Name":"Jon Galloway","Biography":"Jon is a Windows Azure Technical Evangelist focused on ASP.NET MVC. He's co–author of Wrox Professional MVC, wrote the MVC Music Store tutorial, helped organize mvcConf, and was part of the first Web Camps world tour in 2010. He's been doing web development on the Microsoft platform since the late '90. Before that, he'd done all kinds of silly things like work as a submarine lieutenant and win the Showcase Showdown on the Price is Right. He spends his free time chipping in on open source projects and organizing the Herding Code podcast (http://herdingcode.com). He Twitters as @jongalloway and blogs at http://weblogs.asp.net/jgalloway","TwitterHandle":"@jongalloway","BlogURL":"http://weblogs.asp.net/jgalloway","Sessions":["/api/sessions.json/Camper-Van-Full-of-ASPNET--Packing-MVC-Web-API-Web-Forms-and-More-Into-One-App"],"LookupId":"Jon-Galloway"},{"SpeakerURI":"/api/speakers.json/James-Bender","Name":"James Bender","Biography":" James is the Vice President of Technology at Improving Enterprises in Columbus, OH. James has been involved in software development and architecture for 18 years. He has worked as a developer and architect on everything from small, single-user applications to Enterprise-scale, multi-user systems.  His specialties are .NET development and architecture, TDD, SOA, WCF, Web Development, cloud computing, and agile development methodologies. He is an experienced mentor and author. James is a Microsoft MVP and former President of the Central Ohio .NET Developers Group.  James book \"Professional Test Driven Development with C#: Developing Real World Applications with TDD\" was released in May of 2011. His second book \"JavaScript and HTML 5 for Windows 8 Development\" will be available soon.","TwitterHandle":"@JamesBender","BlogURL":"http://www.jamescbender.com","Sessions":["/api/sessions.json/BDD-in-NET-with-SpecFlow"],"LookupId":"James-Bender"},{"SpeakerURI":"/api/speakers.json/John-Lindquist","Name":"John Lindquist","Biography":"John is a Technology Evangelist at JetBrains (http://jetbrains.com).\n\nJohn has spent the majority of his career developing Rich Web Applications. Before joining JetBrains, he was a Technical Architect at Roundarch (http://roundarch.com) for 3 years leading large teams in building the latest and greatest in web apps for the Air Force, HBO, and Bloomberg. \n\nJohn focuses much of his free time on delivering high-quality video tutorials and offering them up for free on his youtube channel (http://youtube.com/johnlindquist).","TwitterHandle":"@johnlindquist","BlogURL":"http://johnlindquist.com","Sessions":["/api/sessions.json/AngularJS-The-HTML-of-the-Future"],"LookupId":"John-Lindquist"},{"SpeakerURI":"/api/speakers.json/Philip-Japikse","Name":"Philip Japikse","Biography":"An international speaker, Microsoft MVP, MCSD, CSM, and CSP, and a passionate member of the developer community, Phil Japikse has been working with .Net since the first betas, developing software for over 20 years, and heavily involved in the agile community since 2005. Phil works as a Developer Evangelist for Telerik's RadControls for Windows 8 as well as the Just family of products (JustCode, JustMock, JustTrace, and JustDecompile), serves as the Lead Director for the Cincinnati .Net User’s Group and the Cincinnati Software Architect Group, and is the host of the Zero To Agile podcast (www.telerik.com/zerotoagile). Phil also founded Agile Conferences, Inc., a non-profit dedicated to advancing agile in all aspects of software development. Phil also serves as Cub Scout Committee Chair for his sons’ Cub Scout Pack, volunteers for the National Ski Patrol, and is a recently retired Firefighter/Paramedic. You can follow Phil on twitter via www.twitter.com/skimedic and read his blog at www.skimedic.com/blog.","TwitterHandle":"@skimedic","BlogURL":"http://www.skimedic.com/blog","Sessions":["/api/sessions.json/Testing-Code-From-The-Pit-Of-Despair"],"LookupId":"Philip-Japikse"},{"SpeakerURI":"/api/speakers.json/Elise-Worthy","Name":"Elise Worthy","Biography":"Elise is a recent graduate of the Hungry Academy program from LivingSocial. After only 5 months of training, she's now a developer at LivingSocial. She focuses on surfacing data to LivingSocial's merchants using a lot of ruby and javascript. When she is not computering, she likes museums and Bertrand Russell.","TwitterHandle":"@eliseworthy","BlogURL":"http://blog.mewie.com","Sessions":["/api/sessions.json/Getting-Good-How-to-Integrate-Novice-Developers-into-Your-Team"],"LookupId":"Elise-Worthy"},{"SpeakerURI":"/api/speakers.json/Jamie-Begin","Name":"Jamie Begin","Biography":"Jamie is a cloud consultant and DevOps engineer with RightBrain Networks, a software consultancy near Ann Arbor, Michigan. He has been working with Amazon Web Services (AWS) since the first pubic beta in 2006 and is founder and current host of AWS Michigan, the official user group for the region. Jamie has worked with everyone from the IRS Criminal Investigation Divisions to numerous tech start-ups on AWS architecture and deployment strategies.","Sessions":["/api/sessions.json/How-to-Build-Resilient--Scalable-PHP-Applications-on-Amazon-Web-Services"],"LookupId":"Jamie-Begin"},{"SpeakerURI":"/api/speakers.json/Justine-Arreche","Name":"Justine Arreche","Biography":"Professionally, I’m a graphic designer for Neo in Columbus, Ohio. I’ve been designing for 12 years with the last 4 years studying and completing my Bachelor’s Degree in Advertising and Graphic Design at the Columbus College of Art and Design. I design for both print and web/mobile platforms.\n\nOn a personal note I’m a 24 year old foul-mouthed, American lady who worships swiss influenced design, enjoys cigarettes, and quality time with my Newfoundland pup, Roscoe.","TwitterHandle":"@TheElefanta","BlogURL":"http://www.theelefanta.com","Sessions":["/api/sessions.json/I-Am-Designer-and-So-Can-You"],"LookupId":"Justine-Arreche"},{"SpeakerURI":"/api/speakers.json/Jim-Weirich","Name":"Jim Weirich","Biography":"Jim Weirich first learned about computers when his college adviser suggested he take a computer science course: \"It will be useful, and you might enjoy it.\" With those prophetic words, Jim has been developing now for over 25 years, working with everything from crunching rocket launch data on supercomputers to wiring up servos and LEDs on micro-controllers.  Currently he loves working in Ruby and Rails as the Chief Scientist at New Context, but you can also find him strumming on his ukulele as time permits.\n","TwitterHandle":"@jimweirich","BlogURL":"http://onestepback.org","Sessions":["/api/sessions.json/Better-Testing-with-GivenWhenThen","/api/sessions.json/Vital-Testing-Tuesday-Half-Day-PM"],"LookupId":"Jim-Weirich"},{"SpeakerURI":"/api/speakers.json/Howard-Lewis-Ship","Name":"Howard Lewis Ship","Biography":"Howard Lewis Ship is the creator and lead developer for the Apache Tapestry project, is respected in the Java community as an expert on web application development, dependency injection, Java meta-programming, and developer productivity. He has over twenty years of full-time software development under his belt, with over fourteen years of Java. He cut his teeth writing customer support software for Stratus Computer, but eventually traded PL/1 for Objective-C and NeXTSTEP before settling into Java.\n\n\nHoward is a frequent speaker at JavaOne, NoFluffJustStuff, ApacheCon and other conferences, and the author of \"Tapestry in Action\" for Manning (covering Tapestry 3.0).  Lately, he's been dipping his toes into alternate languages, including Haskell, Clojure, and Lua.\n\n\nHoward is an independent consultant, offering Tapestry training, mentoring and project work as well as training in Clojure.  He lives in Portland, Oregon with his wife Suzanne, and his son, Jacob.\n\n","TwitterHandle":"@hlship","BlogURL":"http://tapestryjava.blogspot.com","Sessions":["/api/sessions.json/Testing-Web-Applications-with-Geb"],"LookupId":"Howard-Lewis-Ship"},{"SpeakerURI":"/api/speakers.json/Daniel-Mohl","Name":"Daniel Mohl","Biography":"Daniel Mohl is a professional software engineer/architect whose interests include understanding the intricacies of various programming languages, enterprise application architecture, and how to bridge the gap between business and technology. He is a F# MVP, author, C# Insider, F# Insider, blogger, speaker, and event organizer. You can follow him on twitter at www.twitter.com/dmohl.","TwitterHandle":"@dmohl","BlogURL":"http://blog.danielmohl.com","Sessions":["/api/sessions.json/CoffeeScript-Good-Bold-and-with-Sugar"],"LookupId":"Daniel-Mohl"},{"SpeakerURI":"/api/speakers.json/Benjamin-Winkler","Name":"Benjamin Winkler","Biography":"Benjamin Winkler is a lawyer and developer in Columbus.  He has been an attorney for seven years, most recently as principal in Winkler Law Ltd, a practice devoted to technology professionals.  After spending his formative years running a MUD written in patchy, undocumented C, he is happy to be working in Rails instead.","TwitterHandle":"@abwinkler999","Sessions":["/api/sessions.json/How-to-Start-a-Company"],"LookupId":"Benjamin-Winkler"},{"SpeakerURI":"/api/speakers.json/James-Ward","Name":"James Ward","Biography":"James Ward is a Principal Developer Evangelist at Heroku where he teaches developers how to deploy Java, Play! and Scala apps to the cloud.","TwitterHandle":"@_JamesWard","BlogURL":"http://www.jamesward.com","Sessions":["/api/sessions.json/Practicing-Continuous-Delivery","/api/sessions.json/ClientServer-Apps-with-HTML5-Play-CoffeeScript-and-More"],"LookupId":"James-Ward"},{"SpeakerURI":"/api/speakers.json/Brian-Prince","Name":"Brian Prince","Biography":"Brian H. Prince is a Principal Cloud Evangelist for Microsoft, based in the US.\n\nHe gets super excited whenever he talks about technology, especially cloud computing, patterns, and practices. His job is to help customers strategically leverage technology, and help them bring their architecture to a super level.\n\nIn a past life Brian was a part of super startups, super marketing firms, and super consulting firms. Much of his super architecture background includes building super scalable applications, application integration, and award winning web applications. All of them were super.\n\nFurther, he is a co-founder of the non-profit organization CodeMash (www.codemash.org). He speaks at various international technology conferences. He only wishes his job didn’t require him to say ‘super’ so much.\n \nBrian is the co-author of “Azure in Action”, published by Manning Press.\n\nBrian holds a Bachelor of Arts degree in Computer Science and Physics from Capital University, Columbus, Ohio. He is also a zealous gamer. For example, he is a huge fan of Fallout 3, Portal, and pretty much every other game he plays. \n","TwitterHandle":"@brianhprince","BlogURL":"http://brianhprince.com","Sessions":["/api/sessions.json/Gamification-of-our-World"],"LookupId":"Brian-Prince"},{"SpeakerURI":"/api/speakers.json/Chris-Risner","Name":"Chris Risner","Biography":"Chris Risner is a Windows Azure Technical Evangelist at Microsoft.  Chris is focused on using Windows Azure as a backend for iOS and Android clients.  Chris has been working with iOS and Android development for the past several years.  Before working in mobile development, Chris worked on many large scale enterprise applications in Java and .NET. Chis is a prodigious learner who loves technology of all flavors and has a vast amount of experience in Smart Clients, Asp.Net MVC, C#,, Java, Objective C, Android and iOS. Chris speaks from his many successes in different areas of technology. You can find out more about Chris at http://chrisrisner.com and http://twitter.com/chrisrisner.","TwitterHandle":"@chrisrisner","BlogURL":"http://chrisrisner.com","Sessions":["/api/sessions.json/Taking-your-Android-Apps-to-the-Cloud-with-Windows-Azure-Mobile-Services","/api/sessions.json/Getting-Mobile-with-iOS-and-Windows-Azure-Mobile-Services"],"LookupId":"Chris-Risner"},{"SpeakerURI":"/api/speakers.json/Ben-Callahan","Name":"Ben Callahan","Biography":"President of Sparkbox and co-founder of the Build Responsively workshop series, Ben shares his ideas about the web on the Sparkbox Foundry and other industry blogs. His leadership at Sparkbox has driven the team to be a pioneer in responsive web design techniques, and he continues to push for great user experiences outside the context of specific devices.","TwitterHandle":"@bencallahan","BlogURL":"http://seesparkbox.com/foundry/author/ben_callahan","Sessions":["/api/sessions.json/Web-Design-Process-in-a-Responsive-World"],"LookupId":"Ben-Callahan"},{"SpeakerURI":"/api/speakers.json/Michael-S-Collier","Name":"Michael S. Collier","Biography":"Michael Collier serves as a Windows Azure National Architect for Neudesic, a Microsoft SI partner that specializes in Windows Azure.  Michael also holds the distinction of being one of the first Windows Azure MVPs awarded by Microsoft.  He has nearly 11 years of experience building Microsoft-based applications for a wide range of clients. Michael also enjoys speaking about Windows Azure and cloud computing strategies at local user groups, as well as regional and national conferences.  Michael is a co-founder of CloudDevelop, as well as the Central Ohio Cloud Computing User Group in Columbus, OH.  You can follow Michael on Twitter at www.twitter.com/MichaelCollier and on his blog at www.MichaelSCollier.com.","TwitterHandle":"@MichaelCollier","BlogURL":"http://www.michaelscollier","Sessions":["/api/sessions.json/Windows-Azure-Lessons-from-the-Field"],"LookupId":"Michael-S-Collier"},{"SpeakerURI":"/api/speakers.json/Joshua-Smith","Name":"Joshua Smith","Biography":"Josh is the Lead Developer at iRx Reminder, LLC creating systems and\nsoftware for longitudinal medical and health research. He has 15 years\nof professional IT experience and has been a programmer, sysadmin,\nconsultant, owner, employee, and guy who makes sure the pop machine is full. He likes Thai Food, lives in Akron, Ohio with his family and tries to use his powers for good.","TwitterHandle":"@kognate","Sessions":["/api/sessions.json/Go-Go-Golang-Awesome","/api/sessions.json/NSPredicates-for-Fun-and-Profit"],"LookupId":"Joshua-Smith"},{"SpeakerURI":"/api/speakers.json/Rob-Harr","Name":"Rob Harr","Biography":"Technical Director for Sparkbox, Rob is responsible for operations and leading the development team. On any given day, Rob meets with prospective clients, writes code, or continues to lead the charge in improving development process. Sparkbox has become known as a leader in responsive web design and custom software solutions.","TwitterHandle":"@robertharr","BlogURL":"http://seesparkbox.com/foundry","Sessions":["/api/sessions.json/Using-Capistrano-For-Deploying-Everything"],"LookupId":"Rob-Harr"},{"SpeakerURI":"/api/speakers.json/Rob-Tarr","Name":"Rob Tarr","Biography":"Rob is a software engineer with Sparkbox in Dayton, Ohio. He has found an outlet for teaching at the Universtiy of Dayton and Sparkbox's Build Responsively workshops. He spends his time hacking on JavaScript ideas and writing HTML, CSS, PHP & Ruby. When Rob isn't changing the web, he can usually be found building LEGOs with his kids or hanging out with his wife.","TwitterHandle":"@robtarr","BlogURL":"http://seesparkbox.com/foundry/author/rob_tarr","Sessions":["/api/sessions.json/Responsive-JavaScript-Not-Your-Mommas-JS"],"LookupId":"Rob-Tarr"},{"SpeakerURI":"/api/speakers.json/Carl-Quinn","Name":"Carl Quinn","Biography":"Carl Quinn has been developing software professionally for 32 years, starting with BASIC on an Apple II, slogging through C/C++ on DOS, Windows and embedded, and finally landing in the Java-on-Linux world. The one thread through his career has been an inexplicable attraction to developer tools, spending time building them at Borland (C++ & Java IDEs), Sun (Java RAD), Google (Java & C++ build system) and most recently at Netflix (Java build and cloud deployment automation). Carl also co-hosts the Java Posse podcast, the #1 ranked Java technology podcast.","TwitterHandle":"@cquinn","BlogURL":"http://javaposse.com","Sessions":["/api/sessions.json/Netflixs-OSS-Cloud"],"LookupId":"Carl-Quinn"},{"SpeakerURI":"/api/speakers.json/Mike-Benkovich","Name":"Mike Benkovich","Biography":"Mike Benkovich delivers technical presentations around the U.S. to help people explore how new technologies can be used to build powerful solutions to information challenges. He has worked in a variety of professional roles, including architect, project manager, developer, and technical writer. Mike is also an author of two books, published by WROX Press and APress, that show developers how to get the most from their SQL databases. Since appearing in the 1994 Microsoft DevCast, Mike has presented technical information at seminars, conferences, and corporate boardrooms across America.","TwitterHandle":"@mbenko","BlogURL":"http://www.benkotips.com","Sessions":["/api/sessions.json/Building-against-the-Microsoft-Data-Stack"],"LookupId":"Mike-Benkovich"},{"SpeakerURI":"/api/speakers.json/Travis-Smith","Name":"Travis Smith","Biography":"Travis is a polygot developer with a physics background, who has had the chance to build some really cool things and some not so cool other things. Travis is also heavily involved in open source projects, including MassTransit and Topshelf. Travis spends his time speaking at events, watching his cat chase a laser pointer, and playing board games. ","TwitterHandle":"@legomasternet","Sessions":["/api/sessions.json/Jack-or-Java-and-the-Beanstalk---"],"LookupId":"Travis-Smith"},{"SpeakerURI":"/api/speakers.json/Brian-Sherwin","Name":"Brian Sherwin","Biography":"Brian Sherwin is a consultant with Cardinal Solutions Group in Columbus, OH and President of the Central Ohio .Net Developers Group. He has been a consultant and trainer for over 16 years. Trying to get companies to go back to making decisions based on value and not a particular technology is one of his core passions. He devotes his spare time to Continuous Learning, Scouting, and his five kids.","TwitterHandle":"@bsherwin","Sessions":["/api/sessions.json/Controlling-Your-Robot-Army-with-C-Netduino-and-Kinect-"],"LookupId":"Brian-Sherwin"},{"SpeakerURI":"/api/speakers.json/Matt-Winkler","Name":"Matt Winkler","Biography":"Matt is a Principal Program Manager for Hadoop on the SQL Server team at Microsoft. Prior to working in SQL, he has worked on Azure, AppFabric, and Windows Workflow Foundation. Before joining Microsoft 6 years ago, Matt was a consultant in St. Louis building .NET enterprise applications. He originally hails from St. Louis, and spends most of his free time chasing around two great kids.\n","TwitterHandle":"@mwinkle","BlogURL":"http://blogs.msdn.com/mwinkle","Sessions":["/api/sessions.json/Dataflow-Programming-on-Big-Data-with-Scalding-a-Scala-DSL"],"LookupId":"Matt-Winkler"},{"SpeakerURI":"/api/speakers.json/Samidip-Basu","Name":"Samidip Basu","Biography":"Samidip Basu (@samidip) is a technologist, gadget-lover and MSFT Mobility Solutions Lead for Sogeti USA working out of Columbus OH. With a strong developer background in Microsoft technology stack, he now spends much of his time evangelizing Windows Phone/Windows 8 platforms & cloud-supported mobile solutions in general. He passionately runs The Windows Developer User Group (http://thewindowsdeveloperusergroup.com/), labors in M3 Conf (http://m3conf.com/) organization and can be found with at-least a couple of hobbyist projects at any time. His spare times call for travel and culinary adventures with the wife. Find out more at http://samidipbasu.com.","TwitterHandle":"@samidip","BlogURL":"http://samidipbasu.com/","Sessions":["/api/sessions.json/Windows-Phone--SignalR--Awesome-Possibilities"],"LookupId":"Samidip-Basu"},{"SpeakerURI":"/api/speakers.json/Jeff-Kelley","Name":"Jeff Kelley","Biography":"Jeff Kelley is an iOS developer and author of Learn Cocoa Touch, available now from Apress. Jeff speaks at conferences and local Cocoa programming groups on topics such as the Objective-C Runtime and Grand Central Dispatch.  His notable  projects include the Chevy Game Time second-screen experience, the Fathead Big Shot augmented reality product viewer, and the Podcastic podcast player.  Jeff has a reputation of over 8,000 on StackOverflow and works for Detroit Labs in Detroit, MI, doing a combination of client work and independent product development.","TwitterHandle":"@SlaunchaMan","BlogURL":"http://blog.slaunchaman.com","Sessions":["/api/sessions.json/Using-Images-in-iOS"],"LookupId":"Jeff-Kelley"},{"SpeakerURI":"/api/speakers.json/Peter-Ritchie","Name":"Peter Ritchie","Biography":"Peter Ritchie is a software development consultant. Peter is president of Peter Ritchie Inc. Software Consulting Co., a software consulting company in Canada's National Capital Region specializing in Windows-based software development management, process, and implementation consulting. Peter has worked with such clients as Mitel, Nortel, Passport Canada, Innvapost from mentoring to architecture to implementation.  Peter has considerable experience building software development teams and working with startups towards agile software development. Peter's range of experience ranges from designing and implement simple stand-alone applications to architecting n-tier applications spanning dozens of computers; from C++ to C#.","TwitterHandle":"@peterritchie","BlogURL":"http://peterritchie.com/blog","Sessions":["/api/sessions.json/The-Evolution-of-Asynchronous-Programming-on-NET-","/api/sessions.json/Advanced-Unit-Testing-Design-and-How-it-Applies-to-Stakeholders"],"LookupId":"Peter-Ritchie"},{"SpeakerURI":"/api/speakers.json/Jonathan-Small","Name":"Jonathan Small","Biography":"15+ year professional software developer with a great array of development experience.  From old school Vax Basic to jumping onto the WPF bandwagon in its early release. I have been involved in the development of WPF applications for Intuit, Ridge Tool, and currently for CardioInsight.  My focus is on creating a great user driven experience in the software I create.","TwitterHandle":"@yllams","Sessions":["/api/sessions.json/Dont-develop-prototypesSketchflow-them"],"LookupId":"Jonathan-Small"},{"SpeakerURI":"/api/speakers.json/Godfrey-Nolan","Name":"Godfrey Nolan","Biography":"Godfrey is founder and president of RIIS, a development firm in the Detroit Metro area. He is also author of \"Decompiling Java\" (Apress) and  \"Decompiling Android\" (Aperes). Godfrey has spoken at JavaOne, ASP-Connections, VSLive, Codemash, Code PaLOUsa, 1DevDay, and many local Java and .NET user groups on a wide range of topics, such as continuous integration, executable requirements and mobile security.","TwitterHandle":"@godfreynolan","Sessions":["/api/sessions.json/Connecting-to-the-Outside-World"],"LookupId":"Godfrey-Nolan"},{"SpeakerURI":"/api/speakers.json/Bill-Heitzeg","Name":"Bill Heitzeg","Biography":"Bill Heitzeg is the Director of Software Development for The Advisory Board - Ann Arbor.  Bill had been a software developer for 15 years when in 2010 he took the leap into full time management.  As a novice technical manager, Bill has been working hard to educate himself in the many areas of management.  Management, once a thing that other people did, has now become a passion for Bill.   As he once did with C++, COM, Design Patterns, EJBs and Spring, Bill is slowly finding his way on the road to one day becoming a management guru.","TwitterHandle":"@billheitzeg","BlogURL":"http://bill.heitzeg.com","Sessions":["/api/sessions.json/Becoming-a-software-strategist"],"LookupId":"Bill-Heitzeg"},{"SpeakerURI":"/api/speakers.json/JC-Grubbs","Name":"JC Grubbs","Biography":"JC is the chief technical officer at DevMynd, a custom web and mobile software shop based in Chicago, IL.  JC has over 15 years of experience in the web and has worked in technologies from classic ASP to ASP.NET, Java to Ruby, and has had tons of front-end adventures along the way.  Recently he has been leading the team at DevMynd towards a strong mobile practice particularly focused on the effective use of cross-platform technologies.","TwitterHandle":"@thegrubbsian","BlogURL":"http://thegrubbsian.com","Sessions":["/api/sessions.json/The-NativeMobile-Web-Beyond-the-Basics-with-PhoneGap","/api/sessions.json/A-Practical-Guide-to-CSS3--CANCELLED"],"LookupId":"JC-Grubbs"},{"SpeakerURI":"/api/speakers.json/Greg-Levenhagen","Name":"Greg Levenhagen","Biography":"Greg Levenhagen has been designing and developing enterprise solutions and leading projects for a variety of businesses for over 10 years. He has worked on a diverse set of platforms using many different tools. He is a true enthusiast of computer science, with passions and interests including mobile, cloud, architecture, parallel, testing, agile, UX, 3D/games, languages and much more.  Greg is a Senior Software Engineer with Skyline Technologies, Board member of That Conference, Board member of the Fox Valley .NET User's Group, cofounder of the Northeast WI Agile User’s Group, INETA speaker, IEEE member, ACM member, substitute professor and a PhD student. \n\nAlong with being a life-long geek, Greg enjoys golfing, football, woodworking, philosophy and stimulating conversation. \n\nYou can find Greg at http://www.devtreats.com and @GregLevenhagen.\n","TwitterHandle":"@GregLevenhagen","BlogURL":"http://devtreats.com","Sessions":["/api/sessions.json/Windows-8-and-Windows-Phone-with-Azure","/api/sessions.json/How-HTML5-Makes-YOU-a-Windows-8-Store-App-Dev-Already"],"LookupId":"Greg-Levenhagen"},{"SpeakerURI":"/api/speakers.json/Brandon-Rhodes","Name":"Brandon Rhodes","Biography":"Brandon Rhodes is an author, speaker, and programmer who applies Python and JavaScript to problems both large and small; his current project is the Go Botany web app, which the New England Wildflower Society uses to teach students about plant classification. He has maintained PyEphem, the premier Python library for amateur astronomy, since 1998. He has been an invited speaker at Python conferences from Arkansas to Canada and Poland, and was for several years the organizer of the Python Atlanta Meetup before moving to his current home of Bluffton, Ohio.","TwitterHandle":"@brandon_rhodes","BlogURL":"http://rhodesmill.org/brandon/","Sessions":["/api/sessions.json/Touring-the-Universe-with-Scientific-Python"],"LookupId":"Brandon-Rhodes"},{"SpeakerURI":"/api/speakers.json/Lwin-Maung","Name":"Lwin Maung","Biography":"Lwin Maung is a (mobile) developer and an expert on mechatronics. His mobile applications have been featured on technology sites such as engadget, gizmodo, and pocket now. He has also designed and created programmable microcontrollers and robotsfor educational use from the ground up . Lwin has over 7 years of consulting experience in network security, technical support, web, and  VoIP technologies. He is one of the Hero developers for Microsoft generation app profiles. Lwin has also help create Windows 8 certification exams for Microsoft.  ","TwitterHandle":"@lmaung","BlogURL":"http://www.pressffive.com","Sessions":["/api/sessions.json/Taking-the-Microcontrollers-to-the-Next-Level--Make-Your-Very-Own-PCB-circuit-board"],"LookupId":"Lwin-Maung"},{"SpeakerURI":"/api/speakers.json/Parag-Joshi","Name":"Parag Joshi","Biography":"Parag Joshi (@ilovethexbox ) is a Mobile Architect working for Centric Consulting LLC and has over 13 years software development experience working on various Microsoft based technologies. He is co director of the Cincinnati DotNet User Group (CINNUG.org) and also director of the Cincinnati All Things Mobile User Group (Catmug.org). He spends his spare time playing tennis with his 8 year old and writing android apps to track tennis scores.","TwitterHandle":"@ilovethexbox","BlogURL":"http://ilovethexbox.blogspot.com","Sessions":["/api/sessions.json/Introducing-Android"],"LookupId":"Parag-Joshi"},{"SpeakerURI":"/api/speakers.json/Gary-Short","Name":"Gary Short","Biography":"Gary Short is the Head of Gibraltar Labs, a skunk works division of Gibraltar Software, where he spends his time trying to figure out, what the heck is going on.","TwitterHandle":"@garyshort","BlogURL":"http://rocksolid.gibraltarsoftware.com/author/gary","Sessions":["/api/sessions.json/Raspberry-Pi-Deep-Dive","/api/sessions.json/Not-Everything-is-an-Object-Functional-Superiority-with-Clojure"],"LookupId":"Gary-Short"},{"SpeakerURI":"/api/speakers.json/Robert-Cooper","Name":"Robert Cooper","Biography":"Robert Cooper is a developer in Atlanta, Georgia where he works on telemedicine applications. He is the author of GWT in Practice and a contributor to a number of open source applications.","TwitterHandle":"@kebernet","BlogURL":"http://www.screaming-penguin.com","Sessions":["/api/sessions.json/Completely-Modern-GWT"],"LookupId":"Robert-Cooper"},{"SpeakerURI":"/api/speakers.json/Carol-Nichols","Name":"Carol Nichols","Biography":"Carol is a full-stack web application developer who works on open source projects such as rstat.us. She's also a co-organizer of Steel City Ruby Conf. The most \"fun\" she's ever had debugging was when she was developing in Ruby on Windows. Her least favorite error is ECONNREFUSED.","TwitterHandle":"@carols10cents","BlogURL":"http://carol-nichols.com","Sessions":["/api/sessions.json/DONT-PANIC-The-Hitchhikers-Guide-to-Debugging"],"LookupId":"Carol-Nichols"},{"SpeakerURI":"/api/speakers.json/Adam-Ryder","Name":"Adam Ryder","Biography":"Adam Ryder is a developer at Gravity Works Design & Development. He graduated from Lake Superior State University in 2003, and has worked in established Fortune 500 companies as well as cutting-edge start ups. Adam has built multiple mobile applications that have taken advantage of web services built with MVC.","TwitterHandle":"@ryderadam","Sessions":["/api/sessions.json/Introducing-PhoneGap"],"LookupId":"Adam-Ryder"},{"SpeakerURI":"/api/speakers.json/Guy-Royse","Name":"Guy Royse","Biography":"Guy works for Pillar Technology in Columbus, Ohio as an instructor, a consultant, and software engineer.  He has programmed in numerous languages -- many of them semi-colon delimited -- but has more recently been working with Ruby and JavaScript.  He is also the chief organizer for the Columbus JavaScript User Group and is active in the local development community.\n\nIn his personal life, Guy is a hard-boiled geek interested in role-playing games, science fiction, and technology.  He also has a slightly less geeky interest in history and linguistics.  In his spare time he volunteers as Cubmaster for his kids' Cub Scout Pack.","TwitterHandle":"@guyroyse","BlogURL":"http://guyroyse.com","Sessions":["/api/sessions.json/Understanding-Prototypal-Inheritance","/api/sessions.json/Putting-the-DD-in-TDD-Wednesday-All-Day"],"LookupId":"Guy-Royse"},{"SpeakerURI":"/api/speakers.json/Jimmy-Bogard","Name":"Jimmy Bogard","Biography":"Jimmy has delivered solutions ranging from shrink–wrapped products to enterprise e–commerce applications for Fortune 100 customers. He is also a Microsoft Certified Application Developer (MCAD) and is an active member in the .NET community, leading open source projects, giving technical presentations, and facilitating technical book clubs. Jimmy is a member of the ASPInsiders group, the C# Insiders group, and received the \"Microsoft Most Valuable Professional\" (MVP) award for ASP.NET in 2009-2012. Jimmy is also the creator and lead developer of the popular OSS library AutoMapper.","TwitterHandle":"@jbogard","BlogURL":"http://jimmybogard.lostechies.com","Sessions":["/api/sessions.json/Functional-Testing-with-ASPNET-MVC","/api/sessions.json/Building-External-DSLs-for-Fun-and-Profit","/api/sessions.json/NServiceBus-Crash-Course-Tuesday-All-Day"],"LookupId":"Jimmy-Bogard"},{"SpeakerURI":"/api/speakers.json/Chris-Nelson","Name":"Chris Nelson","TwitterHandle":"@superchris","BlogURL":"http://blog.gaslightsoftware.com","Sessions":["/api/sessions.json/Lessons-from-Two-Years-of-Backbonejs"],"LookupId":"Chris-Nelson"},{"SpeakerURI":"/api/speakers.json/Sharon-Cichelli","Name":"Sharon Cichelli","Biography":"Sharon Cichelli is a Headspring Senior Consultant, developing custom enterprise software for her clients and leading training classes on the latest Microsoft technologies. She is a .NET developer, open-source contributor, user group organizer, technical blogger, and Arduino enthusiast.","TwitterHandle":"@scichelli","BlogURL":"http://www.GirlWritesCode.com","Sessions":["/api/sessions.json/Hello-Arduino-Write-Code-that-Interacts-with-the-Real-World"],"LookupId":"Sharon-Cichelli"},{"SpeakerURI":"/api/speakers.json/Doug-Alcorn","Name":"Doug Alcorn","Biography":"Doug is a member of Gaslight with more than 10 years experience doing agile software development and a proponent of test driven development. The hardest part has been helping new customers understand the process and how to manage their risk.","TwitterHandle":"@dougalcorn","BlogURL":"http://blog.gaslightsoftware.com","Sessions":["/api/sessions.json/The-Holy-Grail-Getting-Your-Customer-to-Write-Acceptance-Tests"],"LookupId":"Doug-Alcorn"},{"SpeakerURI":"/api/speakers.json/Charles-Oliver-Nutter","Name":"Charles Oliver Nutter","Biography":"Charles works on JRuby and JVM languages at Red Hat.","TwitterHandle":"@headius","BlogURL":"http://blog.headius.com","Sessions":["/api/sessions.json/JVM-Bytecode-for-Dummies","/api/sessions.json/JVM-JIT-for-Dummies"],"LookupId":"Charles-Oliver-Nutter"},{"SpeakerURI":"/api/speakers.json/Rick-Copeland","Name":"Rick Copeland","Biography":"Rick Copeland is the principal consultant at Arborian Consulting LLC. Previously, he was a lead software engineer at Geeknet, the company that owns the websites SourceForge, Slashdot, ThinkGeek, and FreeCode. He has spoken at a OSCON, PyCon, and several MongoDB-related events, and is a regular speaker at the Atlanta Python user group and MongoDB user groups, and he authored the O'Reilly title \"Essential SQLAlchemy.\" Rick is the primary developer of Ming, a Python object mapper for MongoDB, as well as Zarkov, a MongoDB-based event logging and aggregation framework. Rick has participated in several initiatives at SourceForge using MongoDB and Python. Prior to GeekNet, Rick worked in fields from retail analytics to hardware chip design. He holds MS in Electrical and Computer Engineering and Bachelor of Computer Engineering degrees from Georgia Tech and a Bachelor of Computer Science degree from Eckerd College.","TwitterHandle":"@rick446","BlogURL":"http://blog.pythonisito.com/","Sessions":["/api/sessions.json/Rapid-and-Scalable-Development-with-MongoDB-PyMongo-and-Ming"],"LookupId":"Rick-Copeland"},{"SpeakerURI":"/api/speakers.json/Bryan-Reinero","Name":"Bryan Reinero","Sessions":["/api/sessions.json/Processing-Big-Data-with-MongoDB"],"LookupId":"Bryan-Reinero"},{"SpeakerURI":"/api/speakers.json/Eric-Hankinson","Name":"Eric Hankinson","Biography":"Eric Hankinson is a developer and sys admin with LeanDog. Eric's fifteen years of software development have provided him with experience on a wide range of technologies. As a member of LeanDog, Eric provides technical mentoring, and delivery of web and mobile apps utilizing agile/XP/lean software development techniques. He is passionate about software craftsmanship, not compromising the user experience, and helping others become better developers.","TwitterHandle":"@kumichou","BlogURL":"http://erichankinson.com","Sessions":["/api/sessions.json/Puppet-for-Developers","/api/sessions.json/Cartography--Coupons--Introducing-iOS6-Passbook--MapKit"],"LookupId":"Eric-Hankinson"},{"SpeakerURI":"/api/speakers.json/Jamie-Wright","Name":"Jamie Wright","Biography":"Jamie Wright is President of Brilliant Fantastic, a software development consulting service provider and an ISV for software management applications. He has over ten years of software development experience in Microsoft technologies and 2 years development experience in Ruby and Ruby on Rails. He specializes in application architecture, design patterns, object-oriented design, and test driven development. He blogs at brilliantfantastic.com and is currently seeking help for his gadget addiction.","TwitterHandle":"@jwright","BlogURL":"http://brilliantfantastic.com/blog","Sessions":["/api/sessions.json/Rails-for-the-NET-Developer"],"LookupId":"Jamie-Wright"},{"SpeakerURI":"/api/speakers.json/Kevin-PilchBisson","Name":"Kevin Pilch-Bisson","Biography":"Kevin has worked on Developer Tools at Microsoft for the last 10 years.  During that time he has worked on the C# and VB.net IDE experience, including features like IntelliSense, formatting, refactoring, colorization and more.  For the last 3 years, he has been the development lead of the IDE Services for Microsoft's Roslyn project.","TwitterHandle":"@Pilchie","BlogURL":"http://blogs.msdn.com/b/kevinpilchbisson/","Sessions":["/api/sessions.json/How-its-Made-Behind-the-scenes-of-Building-Microsoft-Roslyn"],"LookupId":"Kevin-PilchBisson"},{"SpeakerURI":"/api/speakers.json/Kevin-Munc","Name":"Kevin Munc","Biography":"Kevin Munc (@muncman) has been coding professionally for 15 years, working in environments ranging from a Fortune 100 enterprise to a half-dozen employee start up. (That's what you do with a Philosophy degree, right?) These days he's focused on mobile development, consulting through his company, Method Up LLC.","TwitterHandle":"@muncman","Sessions":["/api/sessions.json/CI-for-iOS-Do-more-while-you-sleep"],"LookupId":"Kevin-Munc"},{"SpeakerURI":"/api/speakers.json/Will-Dages","Name":"Will Dages","Biography":"Will likes to build things fast. As a UI/Front End Developer at Findaway World and the Director of Web Operations for Drive to Create, he thrives in a fast-paced, overbooked world where there's never enough time. A self-taught nerd, Will divides his free time between building native apps (2 in the App Store so far and more on the way), countless websites, and teaching himself new technologies.\n\nAn active member of the Cleveland IxDA and Cleveland Web Standards Association, he loves learning new things and meeting interesting people.","TwitterHandle":"@willdages","BlogURL":"http://www.willdages.com","Sessions":["/api/sessions.json/Build-a-Cloud-App-In-an-Afternoon-With-Parse"],"LookupId":"Will-Dages"},{"SpeakerURI":"/api/speakers.json/Jon-Stahl","Name":"Jon Stahl","Biography":"Jon co-founded LeanDog after 18 years of experience providing IT leadership in both Fortune 500 and start up organizations. His passion is eliminating waste, optimizing the performance of IT teams and helping organizations become Lean and Agile. Jon provides hands on experience in organizational transformations to Agile and Lean practices. He openly shares his learning’s at conferences and meet-ups. His office is a boat that he shares with the Cleveland tech community, hosting 12 Tech meet-ups a month. He helps organize events such as IgniteCleveland, Cleveland Startup Weekend & Cleveland GiveCamp. He received his degrees from Ohio State University.","TwitterHandle":"@jonrstahl","BlogURL":"http://jonstahl.com","Sessions":["/api/sessions.json/Agile-Servant-Leadership-practices-with-Moral-Authority-WOOF"],"LookupId":"Jon-Stahl"},{"SpeakerURI":"/api/speakers.json/Geoffrey-Goetz","Name":"Geoffrey Goetz","Biography":"Geoffrey Goetz is currently the Director of Marketing at dBase, founding member of ggeoffre LLC, and published author for GigaOm's TheAppleBlog. Geoffrey’s online articles on Apple related products and technology have been picked up in syndication by popular sites including USA Today, Money, Fortune, Forbes and The New Your Times. Geoffrey is also a published book author (\"Mastering JBuilder\") and veteran international speaker on a variety of topics ranging from Win32, to Java, to Mobile. He has been on the development scene in central Ohio since graduating from Ohio State in 1992. Geoffrey has been a speaker on mobile development at CodeMash, CocoConf, MobileX and the local CIDUG meetings. You may also recall several presentations that Geoffrey has delivered Borland Developers Conference as well as locally at COJUG as far back as the late 90's. Geoffrey’s involvement on the mobile scene started with J2ME (as featured in the January 2000 issue of JDJ) and includes such ubiquitous platforms as Java Ring/Smart Card (when such things existed). Geoffrey has also recently been involved in cross platform and native development on both the iOS and Android platforms for various Fortune 100 and 1000 companies.","TwitterHandle":"@ggeoffre","BlogURL":"http://gigaom.com/author/ggeoffre","Sessions":["/api/sessions.json/Working-with-Maps-in-iOS-6-MapKit-and-CoreLocation-in-Depth"],"LookupId":"Geoffrey-Goetz"},{"SpeakerURI":"/api/speakers.json/Carol-J-Smith","Name":"Carol J. Smith","Biography":"Carol Smith has worked as both an employee and consultant in a wide variety of industries. She has helped businesses through their first usability study, and worked with organizations as they grew their UX practice. Carol is the Customer Insight Manager at The Goodyear Tire & Rubber Company; has a Master's degree in Human-Computer Interaction; and is the Vice President of the User Experience Professionals Association. Carol enjoys spending time with her family; volunteering; and running.","TwitterHandle":"@carologic","Sessions":["/api/sessions.json/Users-are-Losers-Theyll-Like-Whatever-we-Make-and-Other-Fallacies-"],"LookupId":"Carol-J-Smith"},{"SpeakerURI":"/api/speakers.json/William-Klos","Name":"William Klos","Biography":"Bill is a Senior Architect with Centric Consulting and leads the company's cloud practice as well as the Innovation & Research labs within Centric.  He speaks regularly on cloud and mobile architectures while building them as often as he is permitted.  His scaling philosophy is \"Go Wide or Go Home\".  Bill lives in Cincinnati.","TwitterHandle":"@williamklos","Sessions":["/api/sessions.json/Applying-Pizza-Delivery-Lessons-to-Emergency-Helicopter-Dispatching"],"LookupId":"William-Klos"},{"SpeakerURI":"/api/speakers.json/Steve-Horn","Name":"Steve Horn","Biography":"Steve Horn has been deep in geospatial information systems for the past two years working on a consumer-facing map based application that is allowing his users to kick butt.","TwitterHandle":"@stevehorn","BlogURL":"http://stevehorn.cc","Sessions":["/api/sessions.json/Intro-to-GIS-and-Mapping-on-the-Internet-Using-Free-and-Open-Source-Tools"],"LookupId":"Steve-Horn"},{"SpeakerURI":"/api/speakers.json/Mark-Greenway","Name":"Mark Greenway","Biography":"Starting as a web developer in the mid-nineties, and a lone developer since the turn of the millennia.  Mark has spent much time learning the pains of doing things the wrong way.   As a self-described author of many “The Daily WTF” style code over the years.   Independently, developing many patterns that are widely accepted as the right way to do things.  Then more recently a discovery of the community and its resources as the better path. This all leads to a perspective that will broaden the point of view of the presentation. With a quick sense of humor and training from professional speakers, any talk is sure to be informative and entertaining.  ","TwitterHandle":"@hurricanepkt","BlogURL":"http://markgreenway.net","Sessions":["/api/sessions.json/Putting-your-Backbone-Apps-on-strings--Backbone-Marionette-and-its-Lessons-about-Backbone"],"LookupId":"Mark-Greenway"},{"SpeakerURI":"/api/speakers.json/Attila-Domokos","Name":"Attila Domokos","Biography":"Attila Domokos is a software engineer at a Cleveland, OH based startup. He has been involved with software development for 12 years and has strong focus on code quality and testing. He spent 7 years in the Microsoft space but switched to developing Ruby on Rails applications two years ago. You can find him in Cleveland organizing the Saturday afternoon Hackibou sessions where developers get together to practice and learn from each other. Attila enjoys music and plays the ukulele with his son when he is not around the computer.","TwitterHandle":"@adomokos","BlogURL":"http://www.adomokos.com","Sessions":["/api/sessions.json/Simple-and-Beautiful-Rails-Code-with-Functional-Style"],"LookupId":"Attila-Domokos"},{"SpeakerURI":"/api/speakers.json/Harimohan-Bawa","Name":"Harimohan Bawa","Biography":"\"Hari Bawa is a Managing Architect with Information Control Corporation (ICC). He has more than 19 years of IT Software Development and Architecture experience of which 13 plus years is in Java technologies (Mobile, Desktop-Swing, Web and Enterprise). Hari is also Sun Certified Enterprise Architect for JEE 5 and JEE 1.4 platforms. Hari successfully lead his first Mobile Application development effort in 2001 using Personal Java and JME technologies and has been following mobile development since then. Hari was Mobile Architect for Huntington Bank's Android, iPhone and iPad applications and developer for Nationwide Mobile Android application. Hari enjoys working on new and cutting edge Mobile, Web and Enterprise technologies. Hari's current assigment requires deep dive in IBM Business Process Managment v7.5 and other key IBM technologies. Hari can be reached at hbawa@iccohio.com or hsbawa@gmail.com","TwitterHandle":"@bawahari","Sessions":["/api/sessions.json/NFC-Application-Development-on-Android-4x"],"LookupId":"Harimohan-Bawa"},{"SpeakerURI":"/api/speakers.json/Gary-Fredericks","Name":"Gary Fredericks","Biography":"Gary Fredericks lives in Chicago and works on internal tools for Groupon, where he spends most of his time whining about object-oriented programming. In his spare time he experiments with using computers to better demonstrate and understand abstract concepts from math and computer science.","TwitterHandle":"@gfredericks_","BlogURL":"http://gfredericks.com","Sessions":["/api/sessions.json/Put-Some-Parentheses-in-your-Browser-an-introduction-to-ClojureScript"],"LookupId":"Gary-Fredericks"},{"SpeakerURI":"/api/speakers.json/Barry-Hawkins","Name":"Barry Hawkins","Biography":"Barry Hawkins currently serves as Senior Development Director at Riot Games, creators of the video game <a href=\"http://leagueoflegends.com\">League of Legends</a>. At Riot Games and in his prior work as an independent Agile Coach, Barry coaches groups to successfully apply the processes and technical disciplines of Agile/Lean Software Development.\n\nBarry has played various roles in his 17 years in the software industry, including lone developer, team lead, director, and Agile coach and mentor. His technical work has centered around the Java platform. He views technology as a set of tools, each having their own strengths in a given problem domain. He writes on technology, process, and culture in software development at <a href=\"http://barryhawkins.com/blog\">http://barryhawkins.com/blog</a>.\n\nPrior to his career in software, Barry spent 10 years designing and selling industrial packaging and marking systems for manufacturing plants throughout the southeastern United States. He was responsible for the implementation, maintenance, and support of every system he sold, which was a formative experience that continues to influence his approach to consulting and coaching.","Sessions":["/api/sessions.json/Agile-Lean-and-the-Space-Between"],"LookupId":"Barry-Hawkins"},{"SpeakerURI":"/api/speakers.json/Jon-Skeet","Name":"Jon Skeet","Biography":"Jon Skeet is a software engineer at Google London by day, and a\nC# \"enthusiast\" (to put it mildly) in his spare time. He is passionate\nabout the intricacies of C# as a language, and keen to share his\nexperiences whether through his blog or on Stack Overflow. Jon's book\non C#, \"C# in Depth\" is published by Manning and now in its second\nedition. A third edition is on its way. (Although Jon works for\nGoogle, he does not speak on behalf of Google.)","TwitterHandle":"jonskeet","BlogURL":"http://msmvps.com/jon.skeet","Sessions":["/api/sessions.json/How-to-make-the-C-Compiler-or-Team-Cry"],"LookupId":"Jon-Skeet"},{"SpeakerURI":"/api/speakers.json/Dick-Wall","Name":"Dick Wall","Biography":"\nDick Wall is a veteran Java developer who became a full time Scala developer around 4 years ago. He is a partner with Bill Venners in Escalate Software, a Scala training and consulting company, and this is now his full time gig. Dick also founded the Bay Area Scala Enthusiasts (BASE), one of the first Scala user groups in the US, and is founder and co-host of the Java Posse podcast. In his spare time, Dick is a keen cyclist, both road and mountain, a motorcyclist and a hiker. Stories from adventures in these activities have a habit of working their way into Dick's presentations, particularly some of the more remarkable adventures. ","TwitterHandle":"dickwall","Sessions":["/api/sessions.json/Subcut-Simple-Injection-Dependency-Framework-in-Scala"],"LookupId":"Dick-Wall"},{"SpeakerURI":"/api/speakers.json/Dan-Steinberg","Name":"Dan Steinberg","Biography":"Daniel Steinberg has spent the last three decades programming the iPad and iPhone. OK, he hasn't. But he's been programming the iPhone and the iPad since the SDK's first appeared in beta and Mac OS X for many years before. Daniel is author of the book \"iPad and iPhone App Development\", the official book for the Stanford University CS 193P class that you've seen on iTunes U. Daniel presents iPhone and Cocoa training for the Pragmatic Studio and consults through his company Dim Sum Thinking. When he's not coding or talking about coding for the Mac, the iPhone, and the iPad he's probably cooking or hanging out with his wife and daughter.","Sessions":["/api/sessions.json/iOS-6--The-Perfect-Time-to-Start-Developing-for-iPhone-and-iPad"],"LookupId":"Dan-Steinberg"},{"SpeakerURI":"/api/speakers.json/Mike-Wood","Name":"Mike Wood","Biography":"Michael Wood is a Senior Application Developer for Resurgent Capital Services. He describes himself as a problem solving, outdoorsy, user group advising, dog-loving, blog writing, solution creating, event planning, married, technology speaking, father of one kind of guy. When he's not living up to that title he's an avid reader, (horrible) violinist and gamer. Michael is one of the Founding Directors of the Cincinnati .NET User Group as well as the founder of the Cincinnati Software Architecture Special Interest Group.  He is also a Microsoft MVP for Windows Azure. You can catch up with Mike on his blog at http://mvwood.com/blog and on twitter under the handle @mikewo.","Sessions":["/api/sessions.json/Cloud-Architecture-with-Windows-Azure-Tuesday-AM-Half-Day","/api/sessions.json/Cloud-Architecture-with-Windows-Azure-REPEAT-SESSION-Wednesday-AM-Half-Day"],"LookupId":"Mike-Wood"},{"SpeakerURI":"/api/speakers.json/Jon-Kruger","Name":"Jon Kruger","Biography":"Hi, I'm Jon Kruger and I am an independent consultant in Columbus, OH. I specialize in software solutions, project leadership, and Agile coaching and training and I have experience in a wide range of industries and environments. I use my experience as a leader and software developer to find ways to create better quality software, improve the software development process, and maximize value for the business. On the side, I run the Columbus ATDD Developers Group and provide test-driven development training (tddbootcamp.com). You can follow me on my blog (jonkruger.com) or on Twitter (@JonKruger).","TwitterHandle":"@JonKruger","BlogURL":"http://jonkruger.com","Sessions":["/api/sessions.json/NET-TDD-Immersion-Tuesday-Half-Day-PM"],"LookupId":"Jon-Kruger"},{"SpeakerURI":"/api/speakers.json/Alexei-Govorine","Name":"Alexei Govorine","Sessions":["/api/sessions.json/Realizing-Agility-with-Scrum-and-Visual-Studio-2012-Tuesday-All-Day"],"LookupId":"Alexei-Govorine"},{"SpeakerURI":"/api/speakers.json/Dave-Donaldson","Name":"Dave Donaldson","Biography":"Bio forthcoming.","Sessions":["/api/sessions.json/Building-WordPress-Themes-and-PluginsCANCELLED"],"LookupId":"Dave-Donaldson"},{"SpeakerURI":"/api/speakers.json/Matt-Barcomb","Name":"Matt Barcomb","Biography":"Matt Barcomb (@mattbarcomb) is passionate about building collaborative, cross-functional teams; enjoys being out-of-doors; loves punning; and thrives on guiding organizations towards sustainable, adaptive and holistic improvement. Matt started programming as a wee lad and eventually wound up getting paid for it. It took him nearly 10 years before he realized that the \"people problem\" was the biggest issue facing most businesses that use software development. Since then he has spent his time and energy trying to find ways of making the business-software universe a better place to work, play and do business. Matt currently resides in Cleveland and keeps especially busy consulting and hiking. He shares his musings on his blog, http://blog.risingtideharbor.com/","TwitterHandle":"@mattbarcomb","BlogURL":"Diane Zajac-Woodie","Sessions":["/api/sessions.json/Rounding-out-wholeteam-quality-through-exploration-Tuesday-Half-Day-AM"],"LookupId":"Matt-Barcomb"},{"SpeakerURI":"/api/speakers.json/Bill-Wagner","Name":"Bill Wagner","Biography":"Bill has spent his entire career in the software industry, spanning both technical and business roles. He spent eight years as a self-employed consultant before co-founding SRT Solutions with Dianne Marsh. Over the past decade they’ve grown SRT Solutions into a premier software development company, amassing 4 FastTrack awards (2011, 2010, 2008, 2007), the Michigan 50 Companies to Watch award (2011), and making the Inc 500/5000 list (2011 and 2012). Bill was also awarded Automation Alley’s Emerging Technology Leader award in 2011.\nHis technical time is spent between curly braces, primarily with C#. He’s the author of the best selling “Effective C#”, now in its second edition, and “More Effective C#”. His articles have appeared in MSDN Magazine, the C# Developer Center, Visual C++ Developer’s Journal, Visual Studio Magazine,ASP.NET Pro, .NET Developer’s Journal and more. He’s written hundreds of technical articles for software developers. He actively blogs about technical and business topics athttp://www.srtsolutions.com/billwagner.  Bill is also a regional director for Microsoft.\nIn addition to his business and technical accomplishments, Bill is an active community participant.  He volunteers as a math tutor for the Manchester, Mich. schools, where he works to inspire high schoolers to consider a technical career.\nHe received his B.S. in Computer Science from the College of Engineering at the University of Illinois at Urbana Champaign.\n","TwitterHandle":"@billwagner","BlogURL":"http://www.srtsolutions.com/billwagner","Sessions":["/api/sessions.json/C-Async-Programming-Workshop-Wednesday-Half-Day-AM"],"LookupId":"Bill-Wagner"},{"SpeakerURI":"/api/speakers.json/Todd-Kaufman","Name":"Todd Kaufman","Biography":"Todd Kaufman has developed, coached, and managed software development teams in Java, Ruby and .NET. Regardless of platform, he is passionate about finding better ways to build systems with low ceremony and high quality. He has been known to occasionally run long distances and drink scotch, although not necessarily at the same time. Todd delivers outstanding software to his clients through Test Double, a software studio in Columbus, Ohio. ","Sessions":["/api/sessions.json/Lean-and-Mean-Domain-Objects-in-Active-Record-Tuesday-Half-Day-AM"],"LookupId":"Todd-Kaufman"},{"SpeakerURI":"/api/speakers.json/Daniel-Steinberg","Name":"Daniel Steinberg","Sessions":["/api/sessions.json/iOS-6-Quick-Start-Wednesday-Half-Day-AM"],"LookupId":"Daniel-Steinberg"},{"SpeakerURI":"/api/speakers.json/Ben-Riga","Name":"Ben Riga","Biography":"Ben Riga is Senior Technical Evangelist for Windows 8 in Microsoft's Developer and Platform Evangelism (DPE) group. In this role he runs around demonstrating the compelling technical and business value of the Windows platform and how partners benefit when publishing apps to the Windows store. Ben also supports the Microsoft field by engaging in key projects, recruiting target customers/partners, and engaging customers and partners with feedback.","TwitterHandle":"benriga","BlogURL":"http://blogs.msdn.com/b/benriga/","Sessions":["/api/sessions.json/Developing-on-Windows-8-Tuesday-Full-Day-"],"LookupId":"Ben-Riga"},{"SpeakerURI":"/api/speakers.json/Leon-Gersing","Name":"Leon Gersing","Sessions":["/api/sessions.json/Speaker-Workshop-Tuesday-All-Day"],"LookupId":"Leon-Gersing"},{"SpeakerURI":"/api/speakers.json/Christopher-Judd","Name":"Christopher Judd","Biography":"Christopher Judd is the president and primary consultant for Judd Solutions (http://www.juddsolutions.com), an international speaker, an open source evangelist, the Central Ohio Java Users Group (http://www.cojug.org) and Columbus iPhone Developer User Group leader, and the co-author of Beginning Groovy and Grails (Apress, 2008), Enterprise Java Development on a Budget (Apress, 2003) and Pro Eclipse JST (Apress, 2005) as well as the author of the children’s book “Bearable Moments”. He has spent 16 years architecting and developing software for Fortune 500 companies in various industries, including insurance, retail, government, manufacturing, service, and transportation. His current focus is on consulting, mentoring, and training with Java, Java EE, Groovy, Grails, Cloud Computing and mobile platforms like iPhone, Android, Java ME and mobile web.","Sessions":["/api/sessions.json/Java-in-the-Amazon-Clouds--Wednesday-Half-Day-PM"],"LookupId":"Christopher-Judd"},{"SpeakerURI":"/api/speakers.json/Steve-Klabnik","Name":"Steve Klabnik","Biography":"Steve Klabnik hacks on Rails, Resque, and other open source projects. He was a Ruby Hero in 2011, and is writing a book about hypermedia APIs.","Sessions":["/api/sessions.json/Ruby-for-Possible-Converts-Wednesday-Half-Day-AM","/api/sessions.json/Ruby-Style-and-ObjectOriented-Programming-Wednesday-Half-Day-PM"],"LookupId":"Steve-Klabnik"},{"SpeakerURI":"/api/speakers.json/Tim-Wingfield","Name":"Tim Wingfield","Biography":"Tim is a maker of things, lover of beer, and ambassador to the great sport of hockey. He’s been at this software thing for a while now and has used a veritable plethora of languages to craft software. In addition to writing software, Tim coaches and mentors teams on how to deliver quality software quickly using agile and lean practices. When the laptop is closed, Tim enjoys coaching his sons’ hockey teams, playing a little hockey himself, and traveling with his family.\n","Sessions":["/api/sessions.json/Hippie-Free-Backbone-Beyond-the-To-Do-List-Wednesday-All-Day"],"LookupId":"Tim-Wingfield"},{"SpeakerURI":"/api/speakers.json/Dianne-Marsh","Name":"Dianne Marsh","Biography":"Dianne Marsh is the co-founder of SRT Solutions in Ann Arbor, Michigan. Her expertise in software programming and technology includes manufacturing, genomics decision support and real-time processing applications. Dianne started her professional career using C and has enjoyed using many languages, including C++, Java, and C# since then, and is currently having a lot of fun using Scala. Dianne is active with the local user groups, including hosting several. ","Sessions":["/api/sessions.json/Atomic-Scala-Wednesday-Full-Day"],"LookupId":"Dianne-Marsh"},{"SpeakerURI":"/api/speakers.json/Michael-Crute","Name":"Michael Crute","Biography":"Mike Crute or simply \"Crute\" is a software craftsman who loves programming languages and is passionate about agile software development practices. Mike is currently building Finite Loop Software, an agile software consultancy that specializes in web application and mobile development. A few years of working for a large e-commerce website has left him with a desire to solve complicated problems involving lots of machines and petabytes of data. Outside of software development Mike is an experienced systems administrator who wants to help development teams and operations teams work together more effectively.\n\nMike coordinates the Cleveland Python Interest group and contributes to \"From Python Import Podcast.\" He occasionally blogs at mike.crute.org","Sessions":["/api/sessions.json/Web-Development-with-Python-and-Django-Wednesday-Full-Day"],"LookupId":"Michael-Crute"},{"SpeakerURI":"/api/speakers.json/Steve-Smith","Name":"Steve Smith","Biography":"\nSteve Smith is an Executive Vice President of Services for Telerik. Steve is also a Microsoft Regional Director and MVP, as well as a frequent speaker at software developer conferences and events. Steve has (with his wife and partner Michelle) started and sold a number of businesses in his career, including one of the first online developer community websites (ASPAlliance.com), the first Microsoft developer advertising network (Lake Quincy Media), and a successful agile consulting company (NimblePros). Steve has written or contributed to a number of books, most recently 97 Things Every Programmer Should Know, and has published a series of courses for Pluralsight on software design, design patterns, and architecture.\n\nSteve maintains a blog at Ardalis.com and is active on Twitter as @ardalis.  You can find out more about Steve here: http://about.me/stevenasmith","Sessions":["/api/sessions.json/Beginning-Software-Craftsmanship-Wednesday-Half-Day-AM","/api/sessions.json/Intermediate-Software-Craftsmanship-Wednesday-Half-Day-PM"],"LookupId":"Steve-Smith"},{"SpeakerURI":"/api/speakers.json/Jeremy-Miller","Name":"Jeremy Miller","Biography":"Jeremy is the a Software Developer at Extend Health and an active member of the vibrant technical community in Austin, Texas. Jeremy began his IT career writing \"Shadow IT\" applications to automate his engineering documentation, then wandered into software development because it looked like more fun.  Jeremy is the primary author of several open source tools including StructureMap, StoryTeller, and the Fubu project family (http://fubu-project.org/). Jeremy's thoughts on all things software can be found at The Shade Tree Developer at http:⁄⁄jeremydmiller.com.","Sessions":["/api/sessions.json/Making-Test-Automation-with-Web-Applications-Work-Wednesday-Half-Day-AM","/api/sessions.json/Fully-Operational-FubuMVC-10-Wednesday-Half-Day-PM"],"LookupId":"Jeremy-Miller"},{"SpeakerURI":"/api/speakers.json/Kevin-PilchBisson-","Name":"Kevin Pilch-Bisson ","Biography":"Kevin has worked on Developer Tools at Microsoft for the last 10 years. During that time he has worked on the C# and VB.net IDE experience, including features like IntelliSense, formatting, refactoring, colorization and more. For the last 3 years, he has been the development lead of the IDE Services for Microsoft's Roslyn project.","TwitterHandle":"@Pilchie","Sessions":["/api/sessions.json/How-its-made-Behind-the-scenes-of-building-Microsoft-Roslyn-Wednesday-Half-Day-PM"],"LookupId":"Kevin-PilchBisson-"},{"SpeakerURI":"/api/speakers.json/Jeff-Morgan","Name":"Jeff Morgan","Biography":"Jeff \"Cheezy\" Morgan is Chief Technology Officer and a cofounder of LeanDog. He has been coaching teams on Agile and Lean techniques since 2004 with a focus on the Engineering practices. For the past three years he has experienced great success and recognition for his work focusing on helping teams adopt Acceptance Test Driven Development using Cucumber. He is the author of several popular Ruby gems used by software testers throughout the world. He regularly teaches Cucumber classes and workshops and is the author of the book Cucumber & Cheese - A Testers Workshop\n","Sessions":["/api/sessions.json/Web-Testing-with-Ruby-and-Cucumber-Wednesday-Half-Day-AM"],"LookupId":"Jeff-Morgan"},{"SpeakerURI":"/api/speakers.json/Jeff-McWherter","Name":"Jeff McWherter","Biography":"Jeff McWherter and Scott Gowell work together at Gravity Works Design & Development, a consulting shop in Lansing, Michigan founded on a passion for detail-focused design, sound development practices,education, and community involvement. Over the last three years, Jeff and Scott have been pairing together to deliver both web and mobile applications to a wide range of clients, including U2, Molly Maid, Mr. Handy Man and the Michigan High School Athletic Association. If a problem exists they have seen it; with a combined total of over 29 years of professional software consulting experience. Working together to push the envelope of mobile development, they have learned to love new versions of the Android SDK.  They worked with just about every mobile framework out there, and will be able to answer specific questions about your mobile development needs. In 2012 they released Professional Mobile Application Development, published by Wrox. ","Sessions":["/api/sessions.json/Developing-for-the-Android-Wednesday-Half-Day-PM"],"LookupId":"Jeff-McWherter"},{"SpeakerURI":"/api/speakers.json/Mike-Eaton","Name":"Mike Eaton","Biography":"Michael Eaton has been a software developer since the early 90's, but left the so-called security of a \"real job\" for the freedom and flexibility of independence in 2001. Since then, he has focused on client-based technologies and has worked with clients throughout the mid-west. Michael speaks throughout the United States at various regional events, user groups and conferences sharing his love of client development to other developers. Michael runs the Kalamazoo X Conference and is a C# MVP. When not working on projects or spending time with his family, he will most likely be found reading, or honing his skills on the Xbox.","Sessions":["/api/sessions.json/Going-Independent-Tuesday-Full-Day"],"LookupId":"Mike-Eaton"},{"SpeakerURI":"/api/speakers.json/Rob-Gillen","Name":"Rob Gillen","Biography":"Rob is a member of the Intelligent Computing Research Team within the Computational Data Analytics Group at the Oak Ridge National Laboratory. In his role as a research professional, works alongside domain scientists to deliver solutions to complex problems at a national scale. His current research interests include large-scale text analysis, scientific uses of cloud computing, cyber security, and machine learning. At the end of the day, he is simply a computer nerd who thinks it is cool to work at the home of supercomputing within the US and where they have instruments called \"the Spallation Neutron Source\".\n \nPrior to coming to ORNL 5 years ago, Rob was as a solutions architect for a high-end consulting firm where his work included business and systems analysis, provisioning infrastructures for federal, corporate and service provider environments and general application development. He has many years of experience as a professional developer with clients ranging from service providers in Europe and Japan to corporate and federal customers in the US including spending time as a adjunct member of a Microsoft solutions development team.\n","Sessions":["/api/sessions.json/Convenience-vs-Security-Wednesday-Half-Day-AM","/api/sessions.json/Into-the-Mind-of-a-Hacker-Wednesday-Half-Day-PM"],"LookupId":"Rob-Gillen"},{"SpeakerURI":"/api/speakers.json/Jessie-Shternshus-","Name":"Jessie Shternshus ","Biography":"As the founder and owner of The IMPROV EFFECT, Jessie weds her lifelong passion for and expertise in applied improv with the fast pace and demands of the corporate world.  In her classes and workshops she helps people become better listeners, team players, problem solvers, leaders, and communicators. Throughout her career, Jessie has worked with companies such as CBS, Living Social, Expedia, Fidelity Investments and Groupon. Her workshops have been successfully implemented with start-ups, as well as Fortune 500 companies. Jessie has also been speaker at conferences such as Madison Ruby, Conferencia Rails, UXMad, Scrum Alliance, and Agile DC. To find out more go to www.improveffect.com","Sessions":["/api/sessions.json/Creative-Problem-Solving-Wednesday-Half-Day-AM","/api/sessions.json/Creative-Problem-Solving--REPEAT-SESSION--Wednesday-Half-Day-PM"],"LookupId":"Jessie-Shternshus-"},{"SpeakerURI":"/api/speakers.json/Dennis-Burton","Name":"Dennis Burton","Biography":"Dennis Burton is a web developer specializing in solutions instead of platform promotion. His diverse portfolio includes several single-page web applications, online learning management systems, precision measurement using high speed data acquisition applications, as well as automotive diagnostic software. Since the beginning of his career, he has been working with systems that require processing large amounts of data quickly.\n\nDennis has been around long enough to be old to some and young to others, but firmly believes that what you do with your time is more important than how long you have been spending it. As an active member of the development community, Dennis serves on the board of the Ann Arbor .NET User Group, founded the a2node user group, served as an organizer for the Lansing Day of .NET, in addition to speaking at and attending way too many user groups.\n\nYou can find him rambling on as @dburton on Twitter and on his blog at developusing.net.\n","TwitterHandle":"@dburton","Sessions":["/api/sessions.json/Choose-Your-Own-Application--The-Mystery-of-the-SinglePage-App-Tuesday-Half-Day-PM"],"LookupId":"Dennis-Burton"},{"SpeakerURI":"/api/speakers.json/Ray-Camden","Name":"Ray Camden","Biography":"My name is Raymond Camden. I'm a 39 year old married father of three living in beautiful Lafayette, Louisiana. I am a developer evangelist for Adobe. My primary technical focus is on web standards.\n\nI've been lucky to have been invited to speak at many conferences over the years, including CFUNITED and the Adobe MAX conferences. If you would like me to speak at your user group, please contact me.\n\nI'm somewhat of a Star Wars nerd - but don't tell anyone else I told you that.","Sessions":["/api/sessions.json/Developing-Mobile-applications-with-PhoneGap-Tuesday-Half-Day-AM"],"LookupId":"Ray-Camden"},{"SpeakerURI":"/api/speakers.json/Carl-Franklin","Name":"Carl Franklin","Biography":"Carl Franklin is a software developer and co-host of .NET Rocks!,\n(www.dotnetrocks.com) the first and still most popular podcast for .NET developers (since 2002.) Carl is also Executive Producer and owner of Pwop Studios (www.pwop.com), a full-service audio and post-production studio. Carl is also an accomplished musician and the author of GesturePak (www.gesturepak.com), a Gesture Recording and Recognition Toolkit for Kinect For Windows. Carl is a Kinect MVP and a Microsoft Regional Director. Follow him on twitter @carlfranklin.","Sessions":["/api/sessions.json/Gesture-Recognition-with-Kinect-for-Windows","/api/sessions.json/KidzMash-Programming-Kinect"],"LookupId":"Carl-Franklin"},{"SpeakerURI":"/api/speakers.json/Sridhar-Nanjundeswaran","Name":"Sridhar Nanjundeswaran","Biography":"Sridhar is a software engineer at 10gen (the MongoDB company), where he leads the MongoDB on Azure effort and works on the .Net/C# driver. Previously he was a software engineering lead at Microsoft Mediaroom. Prior to Microsoft, Sridhar held software management and development positions at Seven Networks and Oracle. Sridhar earned a master's degree in Computer Science from University of California at Santa Barbara and a bachelor's degree in Computer Science and Engineering from PSG College of Technology, India. ","Sessions":["/api/sessions.json/Building-Deploying-and-Scaling-MongoDB-Tuesday-Half-Day-PM"],"LookupId":"Sridhar-Nanjundeswaran"},{"SpeakerURI":"/api/speakers.json/Seth-Ladd","Name":"Seth Ladd","Biography":"Seth is a web engineer and a Chrome Developer Advocate, helping developers of all sizes launch awesome modern web apps with Dart. He is a book author, conference organizer, and is happy to get his refactoring tools back when writing web apps.\n","Sessions":["/api/sessions.json/Performance-Productivity-Pick-Two-with-Dart"],"LookupId":"Seth-Ladd"},{"SpeakerURI":"/api/speakers.json/All-Attendees","Name":"All Attendees","Sessions":["/api/sessions.json/Breakfast--Tuesday","/api/sessions.json/Breakfast--Wednesday","/api/sessions.json/Breakfast--Thursday","/api/sessions.json/Breakfast--Friday","/api/sessions.json/Lunch--Tuesday","/api/sessions.json/Lunch--Wednesday","/api/sessions.json/Lunch--Thursday","/api/sessions.json/Lunch--Friday","/api/sessions.json/Mixer","/api/sessions.json/Closing--Raffle","/api/sessions.json/Aftermash-Party","/api/sessions.json/Vendor-Sessions--Thursday","/api/sessions.json/Vendor-Sessions--Friday","/api/sessions.json/Attendee-Party","/api/sessions.json/Waterpark-Party","/api/sessions.json/Pecha-Kucha","/api/sessions.json/Dinner--Thursday","/api/sessions.json/Families-Dinner-Meetup","/api/sessions.json/Families-Game-Night","/api/sessions.json/Families-Movie-Night","/api/sessions.json/Families-Up-All-Night","/api/sessions.json/Families-Momz-Spouses-Night-Out"],"LookupId":"All-Attendees"},{"SpeakerURI":"/api/speakers.json/TBD","Name":"TBD","Sessions":["/api/sessions.json/Panel-Discussion"],"LookupId":"TBD"},{"SpeakerURI":"/api/speakers.json/Neal-Ford","Name":"Neal Ford","Sessions":["/api/sessions.json/Keynote"],"LookupId":"Neal-Ford"},{"SpeakerURI":"/api/speakers.json/Telerik","Name":"Telerik","Biography":"Telerik’s mission is to make software development easier and more enjoyable. Our tools for agile project management, collaboration, development and testing allow companies of all sizes to create richer, more stable and aesthetic software faster than ever before. Trusted by over 100,000 customers worldwide for our devotion to quality and customer care, Telerik helps technical and business professionals maximize their productivity and \"deliver more than expected” every day.\n\nAs true craftsmen, we don't believe in compromises and our goal is to only release tools that we can be proud of.","TwitterHandle":"@telerik","BlogURL":"http://www.telerik.com/developer-productivity-tools.aspx","Sessions":["/api/sessions.json/Dojo-Urinal-Kata","/api/sessions.json/Dojo-Greed-Kata","/api/sessions.json/Dojo-Ball-Flow-Challenge","/api/sessions.json/Dojo-Intro-to-Typography--Bingo-Edition","/api/sessions.json/Dojo-String-Calculator-Kata","/api/sessions.json/Dojo-Designing-with-CRAP","/api/sessions.json/Dojo-Gilded-Rose-Kata","/api/sessions.json/Dojo-Marshmallow-Challenge","/api/sessions.json/Dojo-Potter-Kata"],"LookupId":"Telerik"},{"SpeakerURI":"/api/speakers.json/Richard-Campbell","Name":"Richard Campbell","Sessions":["/api/sessions.json/KidzMash-Internet-Safety"],"LookupId":"Richard-Campbell"},{"SpeakerURI":"/api/speakers.json/Matt-Vanvleet","Name":"Matt Vanvleet","Sessions":["/api/sessions.json/KidzMash-RC-Helicopters"],"LookupId":"Matt-Vanvleet"},{"SpeakerURI":"/api/speakers.json/Aydin-Akcasu","Name":"Aydin Akcasu","Sessions":["/api/sessions.json/KidzMash-Kidz-in-Control"],"LookupId":"Aydin-Akcasu"},{"SpeakerURI":"/api/speakers.json/Carol-Smith","Name":"Carol Smith","Sessions":["/api/sessions.json/KidzMash-Negotiation--Design-Strategies"],"LookupId":"Carol-Smith"}]